app/controllers/admin/sessions_controller.rb

SELECT  `administrators`.* FROM `administrators`  WHERE `administrators`.`email_for_index` = 'taro@example.com' LIMIT 1
---
  def create
    @form = Admin::LoginForm.new(params[:admin_login_form])
    if @form.email.present?
      administrator = Administrator.find_by(email_for_index: @form.email.downcase)