app/controllers/admin/staff_events_controller.rb

  def index
    if params[:staff_member_id]
      @staff_member = StaffMember.find(params[:staff_member_id])
---
SELECT `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` IN (8, 1, 13, 14, 6, 4, 16)