app/controllers/admin/staff_members_controller.rb

  def index
    unless current_administrator
      redirect_to :admin_login and return
    end
    @staff_members = StaffMember.order(:family_name_kana, :given_name_kana)
      .page(params[:page])
---
SELECT  `staff_members`.* FROM `staff_members`   ORDER BY `staff_members`.`family_name_kana` ASC, `staff_members`.`given_name_kana` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `staff_members`

  def edit
    @staff_member = StaffMember.find(params[:id])
---
SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 6 LIMIT 1

  def create
    @staff_member = StaffMember.new(staff_member_params)
    if @staff_member.save
---
INSERT INTO `staff_members` (`created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `given_name`, `given_name_kana`, `hashed_password`, `start_date`, `updated_at`) VALUES ('2014-09-13 06:23:13', 'member1@example.com', 'member1@example.com', '山田', 'ヤマダ', '太郎', 'タロウ', '$2a$10$hWTugUxpNWcQqy0FGp0Pd.Zn9q3o2G2K0vSKqsR1/qhnT5rIadHfy', '2014-09-12', '2014-09-13 06:23:13')

  def update
    @staff_member = StaffMember.find(params[:id])
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.save
---
SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 6 LIMIT 1
UPDATE `staff_members` SET `end_date` = '2100-01-01', `updated_at` = '2014-09-20 06:29:18' WHERE `staff_members`.`id` = 6

  def destroy
    staff_member = StaffMember.find(params[:id])
    staff_member.destroy!
---
SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 18 LIMIT 1
DELETE FROM `staff_members` WHERE `staff_members`.`id` = 18