app/controllers/staff/accounts_controller.rb

  def update
    @staff_member = current_staff_member
    @staff_member.assign_attributes(staff_member_params)

    if @staff_member.save
---
UPDATE `staff_members` SET `email` = 'member2@example.com', `email_for_index` = 'member2@example.com', `updated_at` = '2014-09-13 07:23:20' WHERE `staff_members`.`id` = 5