app/controllers/staff/sessions_controller.rb

SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`email_for_index` = 'taro@example.com' LIMIT 1
---
	def create
		@form = Staff::LoginForm.new(params[:staff_login_form])
		if @form.email.present?
			staff_member = StaffMember.find_by(email_for_index: @form.email.downcase)